<center>
<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/module_1/images/SN_web_lightmode.png" width="300"> 
</center>

# Assignment: Exploratory Data Analysis with SQL
Estimated time needed: 60 minutes


# Introduction
Using this R notebook you will perform exploratory data analysis using SQL queries with the RSQLite R package. You will be graded on the accuracy of your results as well as the content of your SQL queries.

### Establish your SQL Lite connection

#### Install RSQLite package
The RSQlite  package needs to be installed in your notebook. Let’s load the RSQLite package by clicking on the following cell and executing it (Shift+Enter):

In [1]:
install.packages("RSQLite")  # Instala el paquete
library(RSQLite)  # Carga el paquete

Updating HTML index of packages in '.Library'

Making 'packages.html' ...
 done

In [2]:
con <- dbConnect(RSQLite::SQLite(), "nombre_de_tu_base_de_datos.sqlite")

In [3]:
dbIsValid(con)  # Revisa si la conexión está activa

[1] TRUE

In [10]:
con <- dbConnect(RSQLite::SQLite(), "mi_base_de_datos.sqlite")
print(dbListTables(con))

[1] "BIKE_SHARING_SYSTEMS"    "CITIES_WEATHER_FORECAST"
[3] "SEOUL_BIKE_SHARING"      "WORLD_CITIES"

In [3]:
con <- dbConnect(RSQLite::SQLite(), "nombre_de_tu_base_de_datos.sqlite")

In [1]:
install.packages("https://cran.r-project.org/src/contrib/Archive/RSQLite/RSQLite_0.10.0.tar.gz", repos = NULL, type = "source", dependencies = TRUE)

Warning message in install.packages("https://cran.r-project.org/src/contrib/Archive/RSQLite/RSQLite_0.10.0.tar.gz", :
“installation of package ‘/tmp/RtmpsUtaU4/downloaded_packages/RSQLite_0.10.0.tar.gz’ had non-zero exit status”

#### Restart Kernel

After installing the RSQLite package, it is necessary to restart R Kernel. Click **Kernel** > **Restart Kernel** from the main menu. This will register the newly installed packages. Now proceed to load the RSQLite package.

#### Load RSQLite
Load the 'RSQLite' library, and use the 'dbConnect( )' function as you did in the previous labs to establish the connection to your SQLite database.  
You are now ready to start running SQL queries using the RSQLite library as you did in Course 3.

In [1]:
library("RSQLite")

In [1]:
# provide your solution here to connect db
library(DBI)
library(RSQLite)

# Crear la conexión a la base de datos
con <- dbConnect(RSQLite::SQLite(), "mi_base_de_datos.sqlite")

In [2]:
library(DBI)
library(RSQLite)
library(readr)  # Para leer los archivos CSV

In [4]:
dbGetQuery(con, "SELECT * FROM WORLD_CITIES LIMIT 5")
dbGetQuery(con, "SELECT * FROM BIKE_SHARING_SYSTEMS LIMIT 5")
dbGetQuery(con, "SELECT * FROM CITIES_WEATHER_FORECAST LIMIT 5")
dbGetQuery(con, "SELECT * FROM SEOUL_BIKE_SHARING LIMIT 5")

  CITY    CITY_ASCII LAT     LNG      COUNTRY     ISO2 ISO3 ADMIN_NAME  CAPITAL
1 Tokyo   Tokyo      35.6897 139.6922 Japan       JP   JPN  Tōkyō       primary
2 Jakarta Jakarta    -6.2146 106.8451 Indonesia   ID   IDN  Jakarta     primary
3 Delhi   Delhi      28.6600  77.2300 India       IN   IND  Delhi       admin
4 Mumbai  Mumbai     18.9667  72.8333 India       IN   IND  Mahārāshtra admin
5 Manila  Manila     14.5958 120.9772 Philippines PH   PHL  Manila      primary
  POPULATION ID
1 37977000   1392685764
2 34540000   1360771077
3 29617000   1356872604
4 23355000   1356226629
5 23088000   1608618140

  COUNTRY   CITY                  SYSTEM         BICYCLES
1 Albania   Tirana                NA              200
2 Argentina Mendoza               NA               40
3 Argentina San Lorenzo, Santa Fe Biciudad         80
4 Argentina Buenos Aires          Serttel Brasil 4000
5 Argentina Rosario               NA              480

  CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clear   10000      12.32 10.91    12.32    1015     50       2.18
2 Seoul Clear   10000      11.48  9.81    11.48    1016     48       1.25
3 Seoul Clouds  10000       9.99  8.82     9.99    1015     46       0.94
4 Seoul Clouds  10000       7.87  7.87     7.87    1014     46       0.83
5 Seoul Clouds  10000      10.09 10.09    10.09    1014     37       1.96
  WIND_DEG SEASON FORECAST_DATETIME
1 248      Spring 1618574400
2 142      Spring 1618585200
3 130      Spring 1618596000
4  31      Spring 1618606800
5 309      Spring 1618617600

  DATE       RENTED_BIKE_COUNT HOUR TEMPERATURE HUMIDITY WIND_SPEED VISIBILITY
1 01/12/2017 254               0    -5.2        37       2.2        2000
2 01/12/2017 204               1    -5.5        38       0.8        2000
3 01/12/2017 173               2    -6.0        39       1.0        2000
4 01/12/2017 107               3    -6.2        40       0.9        2000
5 01/12/2017  78               4    -6.0        36       2.3        2000
  DEW_POINT_TEMPERATURE SOLAR_RADIATION RAINFALL SNOWFALL SEASONS HOLIDAY
1 -17.6                 0               0        0        Winter  No Holiday
2 -17.6                 0               0        0        Winter  No Holiday
3 -17.7                 0               0        0        Winter  No Holiday
4 -17.6                 0               0        0        Winter  No Holiday
5 -18.6                 0               0        0        Winter  No Holiday
  FUNCTIONING_DAY
1 Yes
2 Yes
3 Yes
4 Yes
5 Yes

In [19]:
world_cities <- read_csv("world_cities.csv")
dbWriteTable(con, "WORLD_CITIES", world_cities)

bike_sharing <- read_csv("bike_sharing_systems.csv")
dbWriteTable(con, "BIKE_SHARING_SYSTEMS", bike_sharing)

cities_weather <- read_csv("cities_weather_forecast.csv")
dbWriteTable(con, "CITIES_WEATHER_FORECAST", cities_weather)

seoul_bike <- read_csv("seoul_bike_sharing.csv")
dbWriteTable(con, "SEOUL_BIKE_SHARING", seoul_bike)

Rows: 26569 Columns: 11
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (7): CITY, CITY_ASCII, COUNTRY, ISO2, ISO3, ADMIN_NAME, CAPITAL
dbl (4): LAT, LNG, POPULATION, ID

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
Rows: 480 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (3): COUNTRY, CITY, SYSTEM
dbl (1): BICYCLES

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
Rows: 160 Columns: 12
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (3): CITY, WEATHER, SEASON
dbl  (8): VISIBILITY, TEMP, TEMP_MIN, TEMP_MAX, PRESSURE, HUMIDITY, WIND_SPE...
dttm (1): FORECAST_DATETIME

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
Rows: 8465 Columns: 14
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (4): DATE, SEASONS, HOLIDAY, FUNCTIONING_DAY
dbl (10): RENTED_BIKE_COUNT, HOUR, TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBI...

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [18]:
con <- dbConnect(RSQLite::SQLite(), "mi_base_de_datos.sqlite")

Download the following csv files:

*   [WORLD_CITIES](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/world_cities.csv)

*   [BIKE_SHARING_SYSTEMS](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/bike_sharing_systems.csv)

*   [CITIES_WEATHER_FORECAST](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/cities_weather_forecast.csv)

*   [SEOUL_BIKE_SHARING](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/seoul_bike_sharing.csv)

and load the csv's  into 4 tables as mentioned below
* SEOUL_BIKE_SHARING

* CITIES_WEATHER_FORECAST

* BIKE_SHARING_SYSTEMS 

*  WORLD_CITIES

> Hint : Use the read_csv() function and dbWriteTable() functions


## Task 1 - Record Count
#### Determine how many records are in the seoul_bike_sharing dataset.

### Solution 1

In [22]:
dbGetQuery(con, "SELECT COUNT(*) AS total_registros FROM SEOUL_BIKE_SHARING")

  total_registros
1 8465

## Task 2 - Operational Hours
#### Determine how many hours had non-zero rented bike count.

### Solution 2

In [23]:
dbGetQuery(con, "SELECT COUNT(DISTINCT HOUR) AS horas_funcionamiento FROM SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT > 0")

  horas_funcionamiento
1 24

## Task 3 - Weather Outlook
#### Query the the weather forecast for Seoul over the next 3 hours.
Recall that the records in the CITIES_WEATHER_FORECAST dataset are 3 hours apart, so we just need the first record from the query.

### Solution 3

In [24]:
dbGetQuery(con, "SELECT * FROM CITIES_WEATHER_FORECAST WHERE CITY = 'Seoul' ORDER BY FORECAST_DATETIME LIMIT 1")

  CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clear   10000      12.32 10.91    12.32    1015     50       2.18
  WIND_DEG SEASON FORECAST_DATETIME
1 248      Spring 1618574400

## Task 4 - Seasons
#### Find which seasons are included in the seoul bike sharing dataset.

### Solution 4

In [25]:
dbGetQuery(con, "SELECT DISTINCT SEASONS FROM SEOUL_BIKE_SHARING")

  SEASONS
1 Winter
2 Spring
3 Summer
4 Autumn

## Task 5 - Date Range
#### Find the first and last dates in the Seoul Bike Sharing dataset.

### Solution 5

In [26]:
dbGetQuery(con, "SELECT MIN(DATE) AS primera_fecha, MAX(DATE) AS ultima_fecha FROM SEOUL_BIKE_SHARING")

  primera_fecha ultima_fecha
1 01/01/2018    31/12/2017

## Task 6 - Subquery - 'all-time high'
#### determine which date and hour had the most bike rentals.

### Solution 6

In [27]:
dbGetQuery(con, "SELECT DATE, HOUR, RENTED_BIKE_COUNT FROM SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT = (SELECT MAX(RENTED_BIKE_COUNT) FROM SEOUL_BIKE_SHARING)")

  DATE       HOUR RENTED_BIKE_COUNT
1 19/06/2018 18   3556

## Task 7 - Hourly popularity and temperature by season
#### Determine the average hourly temperature and the average number of bike rentals per hour over each season. List the top ten results by average bike count.

### Solution 7

In [28]:
dbGetQuery(con, "
    SELECT SEASONS, HOUR, 
           AVG(TEMPERATURE) AS temperatura_promedio, 
           AVG(RENTED_BIKE_COUNT) AS alquileres_promedio
    FROM SEOUL_BIKE_SHARING
    GROUP BY SEASONS, HOUR
    ORDER BY alquileres_promedio DESC
    LIMIT 10
")

   SEASONS HOUR temperatura_promedio alquileres_promedio
1  Summer  18   29.38791             2135.141
2  Autumn  18   16.03185             1983.333
3  Summer  19   28.27378             1889.250
4  Summer  20   27.06630             1801.924
5  Summer  21   26.27826             1754.065
6  Spring  18   15.97222             1689.311
7  Summer  22   25.69891             1567.870
8  Autumn  17   17.27778             1562.877
9  Summer  17   30.07691             1526.293
10 Autumn  19   15.06346             1515.568

## Task 8 - Rental Seasonality
#### Find the average hourly bike count during each season. 
Also include the minimum, maximum, and standard deviation of the hourly bike count for each season. 

> Hint : Use the SQRT(AVG(col*col) - AVG(col)*AVG(col) ) function where col refers to your column name for finding the standard deviation

### Solution 8

In [29]:
dbGetQuery(con, "
    SELECT SEASONS, 
           AVG(RENTED_BIKE_COUNT) AS promedio_alquileres, 
           MIN(RENTED_BIKE_COUNT) AS minimo_alquileres, 
           MAX(RENTED_BIKE_COUNT) AS maximo_alquileres, 
           SQRT(AVG(RENTED_BIKE_COUNT * RENTED_BIKE_COUNT) - AVG(RENTED_BIKE_COUNT) * AVG(RENTED_BIKE_COUNT)) AS desviacion_estandar
    FROM SEOUL_BIKE_SHARING
    GROUP BY SEASONS
    ORDER BY promedio_alquileres DESC
")

  SEASONS promedio_alquileres minimo_alquileres maximo_alquileres
1 Summer  1034.0734           9                 3556
2 Autumn   924.1105           2                 3298
3 Spring   746.2542           2                 3251
4 Winter   225.5412           3                  937
  desviacion_estandar
1 690.0884
2 617.3885
3 618.5247
4 150.3374

Let's explore a bit and see what might be the most significant contributing factors in terms of the provided data.

## Task 9 - Weather Seasonality
#### Consider the weather over each season. On average, what were the TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBILITY, DEW_POINT_TEMPERATURE, SOLAR_RADIATION, RAINFALL, and SNOWFALL per season?
Include the average bike count as well , and rank the results by average bike count so you can see if it is correlated with the weather at all.

### Solution 9

In [9]:
query <- """
SELECT 
    CASE 
        WHEN SUBSTR(FECHA, 4, 2) IN ('12', '01', '02') THEN 'Invierno'
        WHEN SUBSTR(FECHA, 4, 2) IN ('03', '04', '05') THEN 'Primavera'
        WHEN SUBSTR(FECHA, 4, 2) IN ('06', '07', '08') THEN 'Verano'
        WHEN SUBSTR(FECHA, 4, 2) IN ('09', '10', '11') THEN 'Otonio'
    END AS season,
    ROUND(AVG(TEMPERATURA), 2) AS avg_temperature,
    ROUND(AVG(HUMEDAD), 2) AS avg_humidity,
    ROUND(AVG(WIND_SPEED), 2) AS avg_wind_speed,
    ROUND(AVG(VISIBILIDAD), 2) AS avg_visibility,
    ROUND(AVG(DEW_POINT_TEMPERATURE), 2) AS avg_dew_point_temp,
    ROUND(AVG(SOLAR_RADIATION), 2) AS avg_solar_radiation,
    ROUND(AVG(PRECIPITACIÓN), 2) AS avg_precipitation,
    ROUND(AVG(NEVADA), 2) AS avg_snowfall,
    ROUND(AVG(RENTED_BIKE_COUNT), 2) AS avg_bike_count
FROM SEOUL_BIKE_SHARING
GROUP BY season
ORDER BY avg_bike_count DESC;
"""Lab-SQL-EDA_SQlite.ipynb

dbGetQuery(con, query)

ERROR: Error in parse(text = input): <text>:1:12: unexpected string constant
20: ORDER BY avg_bike_count DESC;
21: "
               ^

## Task 10 - Total Bike Count and City Info for Seoul
#### Use an implicit join across the WORLD_CITIES and the BIKE_SHARING_SYSTEMS tables to determine the total number of bikes avaialble in Seoul, plus the following city information about Seoul: CITY, COUNTRY, LAT, LON, POPULATION, in a single view.
Notice that in this case, the CITY column will work for the WORLD_CITIES table, but in general you would have to use the CITY_ASCII column.

### Solution 10

In [3]:

dbListTables(con)

ERROR: Error in dbListTables(con): could not find function "dbListTables"

In [22]:
SELECT 
    wc.CIUDAD AS CITY, 
    wc.PAÍS AS COUNTRY, 
    wc.LAT, 
    wc.GNL AS LON, 
    wc.POBLACIÓN AS POPULATION, 
    bss.NUM_BIKES AS TOTAL_BIKES
FROM WORLD_CITIES wc, BIKE_SHARING_SYSTEMS bss
WHERE wc.CIUDAD COLLATE NOCASE = 'Seúl'
AND bss.CITY_ASCII COLLATE NOCASE = 'Seoul';

ERROR: Error in parse(text = input): <text>:2:15: unexpected symbol
1: SELECT
2:     wc.CIUDAD AS
                 ^

## Task 11 - Find all city names and coordinates with comparable bike scale to Seoul's bike sharing system
#### Find all cities with total bike counts between 15000 and 20000. Return the city and country names, plus the coordinates (LAT, LNG), population, and number of bicycles for each city.
Later we will ask you to visualize these similar cities on leaflet, with some weather data.

### Solution 11

In [ ]:
# provide your solution here

In [ ]:
close(conn)

## Author(s)

<h4> Jeff Grossman </h4>
<h4> Lakshmi Holla </h4>


## Other Contributor(s)

<h4>  Malika Singla </h4>

<!--## Change log

| Date (YYYY-MM-DD) | Version | Changed By | Change Description                 |
| ----------------- | ------- | ---------- | ---------------------------------- |
| 2022-03-03        | 1.0     |Lakshmi Holla  | Created lab using sqlite3          |-->

## <h3 align="center"> © IBM Corporation 2022. All rights reserved. <h3/>